In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [45]:
price_data = pd.read_csv('pricedBitcoin2009-2018.csv')
print(price_data.head())

            date  price  year  day  totaltx
0  6/1/2011 0:00   9.57  2011  152     6464
1  6/2/2011 0:00  10.60  2011  153     7632
2  6/3/2011 0:00  14.29  2011  154     8502
3  6/4/2011 0:00  18.89  2011  155     8766
4  6/5/2011 0:00  16.70  2011  156     8675

In [30]:
occ_chainlets = pd.read_csv('OccChainletsInTime.txt', delimiter='\t')
print(occ_chainlets.head())

   year  day  totaltx  1:1  1:2  1:3  1:4  1:5  1:6  1:7  ...  20:11  20:12  \
0  2009    3        1    1    0    0    0    0    0    0  ...      0      0
1  2009    8       14   14    0    0    0    0    0    0  ...      0      0
2  2009    9        7    7    0    0    0    0    0    0  ...      0      0
3  2009   10       69   69    0    0    0    0    0    0  ...      0      0
4  2009   11       91   90    1    0    0    0    0    0  ...      0      0

   20:13  20:14  20:15  20:16  20:17  20:18  20:19  20:20
0      0      0      0      0      0      0      0      0
1      0      0      0      0      0      0      0      0
2      0      0      0      0      0      0      0      0
3      0      0      0      0      0      0      0      0
4      0      0      0      0      0      0      0      0

[5 rows x 403 columns]

In [37]:
amo_chainlets = pd.read_csv('AmoChainletsInTime.txt', delimiter='\t')
print(amo_chainlets.head())

   year  day       totaltx           1:1         1:2  1:3  1:4  1:5  1:6  1:7  \
0  2009    3    5000000000    5000000000           0    0    0    0    0    0
1  2009    8   70000000000   70000000000           0    0    0    0    0    0
2  2009    9   35000000000   35000000000           0    0    0    0    0    0
3  2009   10  345000000000  345000000000           0    0    0    0    0    0
4  2009   11  455000000000  450000000000  5000000000    0    0    0    0    0

   ...  20:11  20:12  20:13  20:14  20:15  20:16  20:17  20:18  20:19  20:20
0  ...      0      0      0      0      0      0      0      0      0      0
1  ...      0      0      0      0      0      0      0      0      0      0
2  ...      0      0      0      0      0      0      0      0      0      0
3  ...      0      0      0      0      0      0      0      0      0      0
4  ...      0      0      0      0      0      0      0      0      0      0

[5 rows x 403 columns]

In [66]:
# Merge AmoChainlets with price data
amo_combined = pd.merge(amo_chainlets, price_data, on=['year', 'day', 'totaltx'], how='inner', how='inner')

# Merge OccChainlets with price data
occ_combined = pd.merge(occ_chainlets, price_data, on=['year', 'day', 'totaltx'], how='inner')

In [69]:
amo_combined.head(3)

,year,day,totaltx_x,1:1,1:2,1:3,1:4,1:5,1:6,1:7,...,20:14,20:15,20:16,20:17,20:18,20:19,20:20,date,price,totaltx_y
0,2011,152,27829340003352,1304064101495,20614882339535,0,1877900793,0,0,0,...,0,0,0,0,0,0,0,6/1/2011 0:00,9.57,6464
1,2011,153,40701305784966,2011221432106,31399876711578,5000000,4477000000,0,235000000,0,...,0,0,0,0,0,0,0,6/2/2011 0:00,10.60,7632
2,2011,154,61989673935275,2529846575858,47290851587636,14324100000,6327174819,6519700000,5345750000,8773836723,...,0,0,0,0,0,0,0,6/3/2011 0:00,14.29,8502

In [70]:
occ_combined.head(3)

,year,day,totaltx,1:1,1:2,1:3,1:4,1:5,1:6,1:7,...,20:13,20:14,20:15,20:16,20:17,20:18,20:19,20:20,date,price
0,2011,152,6464,752,4312,0,1,0,0,0,...,0,0,0,0,0,0,0,0,6/1/2011 0:00,9.57
1,2011,153,7632,908,5074,1,2,0,2,0,...,0,0,0,0,0,0,0,0,6/2/2011 0:00,10.60
2,2011,154,8502,1123,5146,4,2,6,5,7,...,0,0,0,0,0,0,0,0,6/3/2011 0:00,14.29

In [73]:
# Merge Amo and Occ Combined DataFrames
full_combined = pd.merge(amo_combined, occ_combined, on=['year', 'day'], how='inner')

# Check the result
print(full_combined.head(3))
print("Full Combined Shape:", full_combined.shape)

   year  day       totaltx_x          1:1_x           1:2_x        1:3_x  \
0  2011  152  27829340003352  1304064101495  20614882339535            0
1  2011  153  40701305784966  2011221432106  31399876711578      5000000
2  2011  154  61989673935275  2529846575858  47290851587636  14324100000

        1:4_x       1:5_x       1:6_x       1:7_x  ...  20:13_y  20:14_y  \
0  1877900793           0           0           0  ...        0        0
1  4477000000           0   235000000           0  ...        0        0
2  6327174819  6519700000  5345750000  8773836723  ...        0        0

   20:15_y  20:16_y  20:17_y  20:18_y  20:19_y  20:20_y         date_y  \
0        0        0        0        0        0        0  6/1/2011 0:00
1        0        0        0        0        0        0  6/2/2011 0:00
2        0        0        0        0        0        0  6/3/2011 0:00

   price_y
0     9.57
1    10.60
2    14.29

[3 rows x 809 columns]
Full Combined Shape: (2404, 809)

In [74]:
print(f"Amo Combined Shape: {amo_combined.shape}")
print(f"Occ Combined Shape: {occ_combined.shape}")
print(f"Full Combined Shape: {full_combined.shape}")

Amo Combined Shape: (2404, 406)
Occ Combined Shape: (2404, 405)
Full Combined Shape: (2404, 809)

In [75]:
print(full_combined[['year', 'day', 'totaltx']].head())

   year  day  totaltx
0  2011  152     6464
1  2011  153     7632
2  2011  154     8502
3  2011  155     8766
4  2011  156     8675